public class Main {
    public static void main(String[] args){
        //Задача 1
        int age = 19;
        boolean HeIsAnAdult = age >= 18;
        if (HeIsAnAdult) {
            System.out.println("Если возраст человека равен " + age + " он совершеннолетний");
        } else {
            System.out.println("Если возраст человека равен " + age + " он не достиг совершеннолетия, нужно немного подождать");
        }
        //Задача 2

    }

}